---
kind: method
id: M:Autodesk.Revit.DB.PointClouds.IPointCloudAccess.GetColorEncoding
source: html/840dee73-07b4-dc15-227c-1a93ac277b0c.htm
---
# Autodesk.Revit.DB.PointClouds.IPointCloudAccess.GetColorEncoding Method

Returns the encoding used by points in this point cloud.

## Syntax (C#)
```csharp
PointCloudColorEncoding GetColorEncoding()
```

## Returns
The encoding.